---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SiteEditPointsInvisible
source: html/97888ae2-1bb3-0718-8e9d-2416f4daade8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SiteEditPointsInvisible Property

Topographic elements are not visible in your current view. You can modify View Range settings in the view's Properties or Visibility settings in Visibility/Graphics. It is often easier to edit topography in a Site view or a 3D view.

## Syntax (C#)
```csharp
public static FailureDefinitionId SiteEditPointsInvisible { get; }
```